Autodesk.Revit.DB.Structure.FabricSheetType.SetLayoutAsCustomPattern(System.Double,System.Double,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.FabricWireItem},System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.FabricWireItem})
Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern.
Remarks:
The following properties are not used for custom fabric sheet type:
- MajorDirectionWireType;
- MinorDirectionWireType;
- MajorSpacing;
- MinorSpacing.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
minorFabricWireItems:
The fabric wire items in the minor direction.
majorFabricWireItems:
The fabric wire items in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for minorStartOverhang is not a number
-or-
The given value for majorStartOverhang is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018

Autodesk.Revit.DB.Structure.FabricSheetType.Material
The id of the material assigned to wires.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The sheetMaterial cannot map to a valid material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorDirectionWireType
The id of the FabricWireType to be used in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the ElementId minorDirectionWireType is either invalid or not a FabricWireType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Fabric Sheet Type is Custom
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorDirectionWireType
The id of the FabricWireType to be used in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the ElementId majorDirectionWireType is either invalid or not a FabricWireType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Fabric Sheet Type is Custom
Since:
2013